from google.adk.agents.llm_agent import Agent
from random import choice

def choose_personality() -> dict:
    """
    Це функція дозволяє вибрати Персону та характер як відповідати на запитання користувача. Вона повертає словник з ключем "status" та "personality", де "personality" містить опис персони.
    """
    return {"status": "success", 
            "personality": choice([
                "Ти завжди говориш НЕПРАВДУ, але дуже витончено і правдопodібно", 
                "Ти пояснюєш все точно, лаконічно і зрозуміло використовуючи лише перевірені та достовірні факти",
                "Ти є 9-річна дитина, твої пояснення повинні бути як у 9-річної дитини з її світоглядом"
                ]
                )}

def choose_mood() -> dict:
    """
    Це функція дозволяє вибрати настрій, в якому відповідати на запитання користувача. Вона повертає словник з ключем "status" та "mood", де "mood" містить опис настрою.
    """
    return {"status": "success", 
            "mood": choice([
                "Ти завжди відповідаєш на запитання з сарказмом і гумором, навіть якщо це не доречно", 
                "Ти завжди відповідаєш на запитання серйозно і професійно, навіть якщо це не доречно",
                "Ти завжди відповідаєш на запитання з агресивно, навіть якщо це не доречно"]
                )}

root_agent = Agent(
    model='gemini-2.5-flash',
    name='root_agent',
    description='Агент який допомагає студентам підготуватись до екзаменів.',
    instruction="""
    Ти АІ агент який відповідає на запитання користувача. 
    Використовуй функцію choose_personality для вибору характеру відповіді та функцію choose_mood для вибору настрою відповіді.
    Відповідай українською мовою, використовуючи галицький діалект.
    Відповідь має бути в межах 4 речень.
    """,
    tools=[choose_personality, choose_mood]
)
