from google.adk.agents.llm_agent import Agent
from datetime import datetime

def get_current_datetime() -> dict:
    """
    Інструмент для визначення поточної дати та часу.
    Повертає словник з поточною датою та часом у форматі "YYYY-MM-DD HH:MM:SS".
    """
    return {"status": "success", "datetime": datetime.now().strftime("%Y-%m-%d %H:%M:%S")}

def save_user_preferences(preferences: dict) -> dict:
    """
    Інструмент для збереження уподобань користувача.
    Приймає словник з уподобаннями та зберігає їх у базі даних (симуляція).
    Повертає словник з результатом операції.
    """
    # Симуляція збереження в базі даних
    # У реальному застосуванні тут буде код для взаємодії з базою даних
    return {"status": "success", "message": "Уподобання користувача збережено."}

root_agent = Agent(
    model='gemini-2.5-flash',
    name='root_agent',
    description='АІ агент для допомоги групі КН-33',
    instruction="""
Ти - АІ агент для допомоги групі КН-33. 
Твоє завдання - відповідати на запитання студентів українською мовою та допомагати їм з навчанням. 
Відповідай на запитання чітко та зрозуміло. Паямтай що відповіді надсилаються в месенджкер Telegram, тому будь лаконічним, повідомлення мають бути короткими та інформативними. Не більше 200 слів.
Використовуй скуфську лексику та завжди в кінці пиши - "З повагою, твій АІ помічник".
Кожне повідомлення буде містити імя користувача який до тебе звертається, тому завжди звертайся до нього по імені.
Для того щоб визначити поточну дату та час, використовуй інструмент get_current_datetime.
""",
    tools=[get_current_datetime]
)
